# Regresión Logística Titanic

In [2]:
import pandas as pd
import numpy as np
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split

In [3]:
titanic = pd.read_csv('titanic.csv')
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
titanic.drop(columns = 'PassengerId', inplace = True)
titanic.drop(columns = 'Name', inplace = True)
titanic.drop(columns = 'SibSp', inplace = True)
titanic.drop(columns = 'Parch', inplace = True)
titanic.drop(columns = 'Ticket', inplace = True)
titanic.drop(columns = 'Fare', inplace = True)
titanic.drop(columns = 'Cabin', inplace = True)
titanic.drop(columns = 'Embarked', inplace = True)
titanic.head()

   Survived  Pclass     Sex   Age
0         0       3    male  22.0
1         1       1  female  38.0
2         1       3  female  26.0
3         1       1  female  35.0
4         0       3    male  35.0

In [5]:
# Cambiamos las columnas de datos cualitativos a cuantitativos
titanic = pd.get_dummies(titanic, drop_first = True)
titanic.head()

   Survived  Pclass   Age  Sex_male
0         0       3  22.0         1
1         1       1  38.0         0
2         1       3  26.0         0
3         1       1  35.0         0
4         0       3  35.0         1

In [6]:
# Veremos si hay valores nulos:
titanic.isnull().sum().sort_values(ascending = False)

Age         177
Survived      0
Pclass        0
Sex_male      0
dtype: int64

In [7]:
#Como la columna edad es la unica con datos nulos veremos su media
titanic['Age'].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [8]:
#Ahora reemplazaremos los datos nulos por el promedio
titanic['Age'] = titanic['Age'].replace(np.nan,29.7)

In [9]:
# Y veremos como quedó:
titanic.isnull().sum().sort_values(ascending = False)

Survived    0
Pclass      0
Age         0
Sex_male    0
dtype: int64

In [10]:
# Test train split
X_train, X_test, y_train, y_test = train_test_split(titanic.drop('Survived',axis = 1), titanic['Survived'])

In [11]:
# Train the model using the training data
LogReg = LogisticRegression(solver = 'lbfgs')
LogReg.fit(X_train, y_train)

LogisticRegression()

# Predicciones

In [12]:
# Niña de primera clase
LogReg.predict(np.array([[1,8,0]]))

C:\Users\Danko\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LogisticRegression was fitted with feature names
  warnings.warn(

array([1], dtype=int64)

### El resultado es 1, por lo tanto el modelo indica que la niña de 8 años y primera clase sobrevive.

In [13]:
titanic.head()

   Survived  Pclass   Age  Sex_male
0         0       3  22.0         1
1         1       1  38.0         0
2         1       3  26.0         0
3         1       1  35.0         0
4         0       3  35.0         1

# Puntaje del modelo

In [14]:
# Scoring the model
LogReg.score(X_test, y_test)

0.7847533632286996

# Comprendiendo el puntaje del modelo
### Sumaremos todas las predicciones correctas y las dividiremos por el total de predicciones

In [15]:
# Understanding the score.
prediction = (LogReg.predict(X_test)>.5).astype(int)
np.sum(prediction == y_test)/len(y_test)

0.7847533632286996